export default class Dictionary {
    static userInfo = {
        "bureauID":"{B0FF7BE0-B4C0-E940-A1FA-9C27F19D884B}",
        "bureauName":"综合办公室",
        "dN":"cn=OA系统技术支持,ou=信息中心,ou=综合办公室,ou=区直部门,o=光明新区",
        "deptID":"{AC18B3FB-0000-0000-7C6D-3E7800000002}",
        "deptName":"信息中心",
        "loginName":"jszc",
        "loginTime":1539918037950,
        "mobile":"13715039080",
        "name":"OA系统技术支持",
        "officePhone":"88211337",
        "userID":"{AC18B3FB-0000-0000-7BF1-451A00000001}"
    }
    //预算计划/计划类别
    static jhType = {
        '0':'大额资金项目支出计划',
        '1':'培训/会议计划',
        '2':'课题计划'
    }
    //预算计划/状态
    static staflag = {
        '0':'未上报',
        '1':'已上报'
    }
    //预算计划/审批状态
    static spStatus = {
        '1':'编制中',
        '2':'审核中',
        '4':'执行中',
        '3':'已完成',
        '5':'调整中'
    }
    //预算计划/审批状态
    // static spStatus = {
    //     '1':'初核',
    //     '2':'复核',
    //     '3':'退回',
    //     '4':'调整',
    //     '5':'终审'
    // }
    //性别
    static xbType = {
        '1':'男',
        '2':'女',
        '0':'未知',
        '9':'未说明的性别',
    }
   
    //应急目录管理/物资类别
    static wzType = {
        '1':'电力工程抢险',
        '2':'通信工程抢险',
        '3':'动物疫情处置',
        '4':'基本生活物资保障',
        '5':'网络安全保障',
        '6':'成品油',
    }
    //储备库点分类
    static cbkType = {
        '1':'粮食库点',
        '2':'军粮库点',
        '3':'食用油库点',
        '4':'冻猪肉库点',
        '5':'活体猪库点',
        '6':'食盐库点',
        '7':'药品库点',
    }

    //物资分类
    static wzcbxxType = {
        'A':'A类物资',
        'B':'B类物资',
        'C':'C类物资',
    }

    //设备分类
    static sbflType = {
        'A':'重点设备（A类设备）',
        'B':'主要设备（B类设备）',
        'C':'一般设备（B类设备）',
    }

    //应急指挥部
    static yjzhbType = {
        '1':'市电力事故应急指挥部',
        '2':'市通讯保障应急指挥部',
        '3':'市重大动物疫情应急指挥部',
        '4':'市网络与信息安全突发事件应急指挥部',
        '5':'市生活必需品突发事件应急指挥部',
        '6':'市成品油市场供应应急指挥部',
    }

    
    //应急组织基本信息
    static jyzzType = {
        '1':'国内或国际间的应急响应协调组织',
        '2':'企业或政府的应急响应组织',
        '3':'计算机软件厂商提供的应急响应组织',
        '4':'商业化的应急响应组织',
    }

    //应急救援队伍类型
    static jydwType = {
        '1':'防汛抗旱应急队',
        '2':'气象灾难应急队',
        '3':'地质灾害应急队',
        '4':'地震灾害应急队',
        '5':'森林防火应急队',
        '6':'矿山、危险化学品应急队',
        '7':'环境污染应急队',
    }
       
    //应急专家类型
    static jyzjType = {
        '1':'自然灾害类',
        '2':'事故灾难类',
        '3':'公共卫生事件类',
        '4':'社会安全事件类',
    }

    //所在专家组
    static zjzType = {
        '1':'煤矿组',
        '2':'机电排水',
        '3':'采矿通风',
    }
}