export default class Dictionary {

    //应急目录管理/物资类别
    static wzType = {
        '1':'电力工程抢险',
        '2':'通信工程抢险',
        '3':'动物疫情处置',
        '4':'基本生活物资保障',
        '5':'网络安全保障',
        '6':'成品油',
    }
    //储备库点分类
    static cbkType = {
        '1':'粮食库点',
        '2':'军粮库点',
        '3':'食用油库点',
        '4':'冻猪肉库点',
        '5':'活体猪库点',
        '6':'食盐库点',
        '7':'药品库点',
    }

    //物资分类
    static wzcbxxType = {
        'A':'A类物资',
        'B':'B类物资',
        'C':'C类物资',
    }

    //设备分类
    static sbflType = {
        'A':'重点设备（A类设备）',
        'B':'主要设备（B类设备）',
        'C':'一般设备（B类设备）',
    }

    //应急指挥部
    static yjzhbType = {
        '1':'市电力事故应急指挥部',
        '2':'市通讯保障应急指挥部',
        '3':'市重大动物疫情应急指挥部',
        '4':'市网络与信息安全突发事件应急指挥部',
        '5':'市生活必需品突发事件应急指挥部',
        '6':'市成品油市场供应应急指挥部',
    }

    
    //应急指挥部
    static jydwType = {
        '1':'国内或国际间的应急响应协调组织',
        '2':'企业或政府的应急响应组织',
        '3':'计算机软件厂商提供的应急响应组织',
        '4':'商业化的应急响应组织',

    }
}